Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnectionInstance.ExcludeObjectsFromConnection(System.Collections.Generic.IEnumerable`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId})
This method allows to disconnect some of the objects created by this connection.
The objects will continue to exist in the model, but they will no longer be controlled / updated by this connection.

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnectionInstance.Drivens
Returns created objects including joints.

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnectionInstance.AllowObjectModification
Allow modification of the created objects.

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnectionInstance.Name
Template connection instance name.

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnectionInstance.CreateFrom(Autodesk.AdvanceSteel.DocumentManagement.OpenDatabase,System.String,System.Collections.Generic.List`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId},System.Collections.Generic.List`1{Autodesk.AdvanceSteel.Modelling.Beam.eEnd})
Create an user defined connection template instance from a template, input objects and beam ends.
db: The database where the template resides
templateName:  The name that uniquely identifies the template
newDrivers:  The new input objects of the connection
beamEnds:  The beam ends for each input object
Returns:  Return the created user connection template instance object

Autodesk.AdvanceSteel.ConstructionTypes.UserDefinedConnectionInstance.CreateFrom(Autodesk.AdvanceSteel.DocumentManagement.OpenDatabase,System.String,System.Collections.Generic.List`1{Autodesk.AdvanceSteel.CADLink.Database.ObjectId})
Create an user defined connection template instance from a template and input objects.
db: The database where the template resides
templateName:  The name that uniquely identifies the template
newDrivers:  The new input objects of the connection
Returns:  Return the created user connection template instance object